# VolumeFill Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VolumeFill Property
ParameterTypeId Class See Also
---
"Fill"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VolumeFill { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VolumeFill As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VolumeFill {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace